#pragma once
#include "Mof.h"
#include "AnimationData.h"

// ********************************************************************************
/// <summary>
/// エフェクト名列挙
/// </summary>
// ********************************************************************************
enum Effect_Name
{
    Effect_Hit,
    Effect_Clear,
    Effect_GameOver,
    Effect_ReadyGo,
    Effect_Count,
};

constexpr int EffectPoolCount = 30;               //! エフェクトプールカウント

const Vector2 InvalidPos = Vector2(-1.0f, -1.0f); //! 無効座標値

// ********************************************************************************
/// <summary>
/// エフェクト管理クラス
/// </summary>
// ********************************************************************************
class CEffectManager
{
private:

    sip::CAnimationData     m_EffectAnimData[Effect_Count];                //! エフェクトデータ配列

    CSpriteMotionController m_EffectMotion[Effect_Count][EffectPoolCount]; //! モーションプール配列

    Vector2                 m_EffectPos[Effect_Count][EffectPoolCount];    //! モーションプール表示座標

    CTexture                m_EffectTexture[Effect_Count];                 //! エフェクト用画像

    // ********************************************************************************
    /// <summary>
    /// コンストラクタ
    /// </summary>
    /// <created>いのうえ,2021/02/02</created>
    /// <changed>いのうえ,2021/02/02</changed>
    // ********************************************************************************
    CEffectManager(void);

public:

    // ********************************************************************************
    /// <summary>
    /// デストラクタ
    /// </summary>
    /// <created>いのうえ,2021/02/02</created>
    /// <changed>いのうえ,2021/02/02</changed>
    // ********************************************************************************
    ~CEffectManager(void);
    
    // ********************************************************************************
    /// <summary>
    /// インスタンスの取得
    /// </summary>
    /// <returns>マネージャー</returns>
    /// <created>いのうえ,2021/02/02</created>
    /// <changed>いのうえ,2021/02/02</changed>
    // ********************************************************************************
    static CEffectManager& GetInstance(void);

    // ********************************************************************************
    /// <summary>
    /// 読み込み
    /// </summary>
    /// <created>いのうえ,2021/02/02</created>
    /// <changed>いのうえ,2021/02/02</changed>
    // ********************************************************************************
    void Load(void);

    // ********************************************************************************
    /// <summary>
    /// 更新
    /// </summary>
    /// <created>いのうえ,2021/02/02</created>
    /// <changed>いのうえ,2021/02/02</changed>
    // ********************************************************************************
    void Update(void);

    // ********************************************************************************
    /// <summary>
    /// 描画
    /// </summary>
    /// <created>いのうえ,2021/02/02</created>
    /// <changed>いのうえ,2021/02/02</changed>
    // ********************************************************************************
    void Render(void);

    // ********************************************************************************
    /// <summary>
    /// 解放
    /// </summary>
    /// <created>いのうえ,2021/02/02</created>
    /// <changed>いのうえ,2021/02/02</changed>
    // ********************************************************************************
    void Release(void);

    // ********************************************************************************
    /// <summary>
    /// エフェクトの開始
    /// </summary>
    /// <param name="effect">再生するエフェクト</param>
    /// <param name="pos">再生する座標</param>
    /// <created>いのうえ,2021/02/02</created>
    /// <changed>いのうえ,2021/02/02</changed>
    // ********************************************************************************
    void Start(Effect_Name effect, const Vector2& pos);

    // ********************************************************************************
    /// <summary>
    /// エフェクトの開始
    /// </summary>
    /// <param name="effect">再生するエフェクト</param>
    /// <param name="x">再生するX座標</param>
    /// <param name="y">再生するY座標</param>
    /// <created>いのうえ,2021/02/02</created>
    /// <changed>いのうえ,2021/02/02</changed>
    // ********************************************************************************
    void Start(Effect_Name effect, float x, float y);

    // ********************************************************************************
    /// <summary>
    /// モーションデータの取得
    /// </summary>
    /// <param name="effect">モーションの種類</param>
    /// <param name="poolNo">プール番号</param>
    /// <returns>モーションデータ</returns>
    /// <created>いのうえ,2021/02/06</created>
    /// <changed>いのうえ,2021/02/06</changed>
    // ********************************************************************************
    CSpriteMotionController& GetMotion(Effect_Name effect, int poolNo);
};

#define g_EffectManager CEffectManager::GetInstance()