#pragma once
#include "SceneDefine.h"
#include "Button.h"
#include "SoundManager.h"

// ********************************************************************************
/// <summary>
/// ゲームクリアシーンクラス
/// </summary>
// ********************************************************************************
class CGameClear : public MyApp::CScene
{
private:

    CTexture m_PlateTexture;     //! プレート3.png
    CTexture m_BackPlateTexture; //! プレート4.png
    CTexture m_NextStageTexture; //! 次のステージへ.png
    CTexture m_SelectTexture;    //! 選択.png
    CTexture m_GoToTitleTexture; //! タイトルへ.png

    CButton  m_btnNextStage;     //! 次のステージへ行くボタン
    CButton  m_btnGoToTitle;     //! タイトルへ行くボタン

    int      m_SelectNo;         //! 選択番号 0:次のステージへ 1:タイトルへ

    int      m_NowStageNo;       //! 現在のステージ番号保存用

public:

    // ********************************************************************************
    /// <summary>
    /// コンストラクタ
    /// </summary>
    /// <param name="data">シーン共通データ</param>
    /// <created>いのうえ,2021/02/02</created>
    /// <changed>いのうえ,2021/02/02</changed>
    // ********************************************************************************
    explicit CGameClear(const InitData& data);

    // ********************************************************************************
    /// <summary>
    /// デストラクタ
    /// </summary>
    /// <created>いのうえ,2021/02/02</created>
    /// <changed>いのうえ,2021/02/02</changed>
    // ********************************************************************************
    ~CGameClear(void);

    // ********************************************************************************
    /// <summary>
    /// 初期化
    /// </summary>
    /// <created>いのうえ,2021/02/02</created>
    /// <changed>いのうえ,2021/02/02</changed>
    // ********************************************************************************
    void Initialize(void);

    // ********************************************************************************
    /// <summary>
    /// 読み込み
    /// </summary>
    /// <returns>true : 成功, false : 失敗</returns>
    /// <created>いのうえ,2021/02/02</created>
    /// <changed>いのうえ,2021/02/02</changed>
    // ********************************************************************************
    bool Load(void);

    // ********************************************************************************
    /// <summary>
    /// 更新
    /// </summary>
    /// <created>いのうえ,2021/02/02</created>
    /// <changed>いのうえ,2021/02/02</changed>
    // ********************************************************************************
    void Update(void) override;

    // ********************************************************************************
    /// <summary>
    /// 描画
    /// </summary>
    /// <created>いのうえ,2021/02/02</created>
    /// <changed>いのうえ,2021/02/02</changed>
    // ********************************************************************************
    void Render(void) override;

    // ********************************************************************************
    /// <summary>
    /// 解放
    /// </summary>
    /// <created>いのうえ,2021/02/02</created>
    /// <changed>いのうえ,2021/02/02</changed>
    // ********************************************************************************
    void Release(void);
};

