#pragma once
#include "SceneDefine.h"
#include "Button.h"

// ********************************************************************************
/// <summary>
/// ゲームオーバークラス
/// </summary>
// ********************************************************************************
class CGameOver : public MyApp::CScene
{
private:

    CTexture m_GoToTitleTexture;  //! タイトルへ.png
    CTexture m_RetryTexture;      //! リトライ.png
    CTexture m_PlateTexture;      //! プレート2.png
    CTexture m_BackPlateTexture;  //! プレート.png
    CTexture m_GameOverTexture;   //! 文字.png
    CTexture m_SelectTexture;     //! 選択.png

    CButton  m_btnRetry;          //! リトライボタン
    CButton  m_btnGoToTitle;      //! タイトルへボタン

    int      m_SelectNo;          //! 選択番号 0:リトライ 1:タイトルへ

public:

    // ********************************************************************************
    /// <summary>
    /// コンストラクタ
    /// </summary>
    /// <param name="data">シーン共通データ</param>
    /// <created>いのうえ,2021/02/01</created>
    /// <changed>いのうえ,2021/02/01</changed>
    // ********************************************************************************
    explicit CGameOver(const InitData& data);

    // ********************************************************************************
    /// <summary>
    /// デストラクタ
    /// </summary>
    /// <created>いのうえ,2021/02/01</created>
    /// <changed>いのうえ,2021/02/01</changed>
    // ********************************************************************************
    ~CGameOver(void);

    // ********************************************************************************
    /// <summary>
    /// 初期化
    /// </summary>
    /// <created>いのうえ,2021/02/01</created>
    /// <changed>いのうえ,2021/02/01</changed>
    // ********************************************************************************
    void Initialize(void);

    // ********************************************************************************
    /// <summary>
    /// 読み込み
    /// </summary>
    /// <returns>true : 成功, false : 失敗</returns>
    /// <created>いのうえ,2021/02/01</created>
    /// <changed>いのうえ,2021/02/01</changed>
    // ********************************************************************************
    bool Load(void);

    // ********************************************************************************
    /// <summary>
    /// 更新
    /// </summary>
    /// <created>いのうえ,2021/02/01</created>
    /// <changed>いのうえ,2021/02/01</changed>
    // ********************************************************************************
    void Update(void);

    // ********************************************************************************
    /// <summary>
    /// 描画
    /// </summary>
    /// <created>いのうえ,2021/02/01</created>
    /// <changed>いのうえ,2021/02/01</changed>
    // ********************************************************************************
    void Render(void);

    // ********************************************************************************
    /// <summary>
    /// 解放
    /// </summary>
    /// <created>いのうえ,2021/02/01</created>
    /// <changed>いのうえ,2021/02/01</changed>
    // ********************************************************************************
    void Release(void);
};

