#pragma once
#include "SceneDefine.h"
#include "Button.h"
#include "Setting.h"

// ********************************************************************************
/// <summary>
/// タイトルシーンクラス
/// </summary>
// ********************************************************************************
class CTitle : public MyApp::CScene
{
private:

    CTexture m_StartTexture;  //! 始める画像
    CTexture m_EndTexture;    //! 終わる画像
    CTexture m_OptionTexture; //! オプション画像
    CTexture m_PlateTexture;  //! ボタンプレート画像
    CTexture m_SelectTexture; //! 選択画像
    CTexture m_TitleTexture;  //! タイトル画像
    CTexture m_GuideTexture;  //! 操作方法画像

    CButton  m_btnStart;      //! 始めるボタン
    CButton  m_btnOption;     //! オプションボタン
    CButton  m_btnEnd;        //! 終わるボタン
                             
    int      m_SelectNo;      //! 選択番号 0:始める 1:オプション 2:終わる

    CSetting m_OptionWindow;  //! オプション画面

public:

    // ********************************************************************************
    /// <summary>
    /// コンストラクタ
    /// </summary>
    /// <param name="data">共通データ</param>
    /// <created>いのうえ,2021/02/01</created>
    /// <changed>いのうえ,2021/02/01</changed>
    // ********************************************************************************
    explicit CTitle(const InitData& data);

    // ********************************************************************************
    /// <summary>
    /// デストラクタ
    /// </summary>
    /// <created>いのうえ,2021/02/01</created>
    /// <changed>いのうえ,2021/02/01</changed>
    // ********************************************************************************
    ~CTitle(void);

    // ********************************************************************************
    /// <summary>
    /// 初期化
    /// </summary>
    /// <created>いのうえ,2021/02/01</created>
    /// <changed>いのうえ,2021/02/01</changed>
    // ********************************************************************************
    void Initialize(void);

    // ********************************************************************************
    /// <summary>
    /// 読み込み
    /// </summary>
    /// <returns>true : 成功, false : 失敗</returns>
    /// <created>いのうえ,2021/02/01</created>
    /// <changed>いのうえ,2021/02/01</changed>
    // ********************************************************************************
    bool Load(void);

    // ********************************************************************************
    /// <summary>
    /// 更新
    /// </summary>
    /// <created>いのうえ,2021/02/01</created>
    /// <changed>いのうえ,2021/02/01</changed>
    // ********************************************************************************
    void Update(void) override;

    // ********************************************************************************
    /// <summary>
    /// 描画
    /// </summary>
    /// <created>いのうえ,2021/02/01</created>
    /// <changed>いのうえ,2021/02/01</changed>
    // ********************************************************************************
    void Render(void) override;

    // ********************************************************************************
    /// <summary>
    /// 解放
    /// </summary>
    /// <created>いのうえ,2021/02/01</created>
    /// <changed>いのうえ,2021/02/01</changed>
    // ********************************************************************************
    void Release(void);
};

